app/controllers/contacts_controller.rb

INSERT INTO `contacts` (`name`, `email`, `body`, `created_at`, `updated_at`) VALUES ('', '', '', '2017-02-16 21:25:33', '2017-02-16 21:25:33')
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
    def set_contact
      @contact = Contact.find(params[:id])